<a href="https://colab.research.google.com/github/rkkirpane/-Statistics-Part-I/blob/master/Solution_Copy_Code_Along_on_Data_Wrangling_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Wrangling with Pandas

<img src="../images/python_pandas.jpg" alt="Python" style="width: 400px;"/>

# Program so far 

***

- Python Basics
- Python Programming Constructs
- Data Structures
- Functions
- Object Oriented Programming in Python
- NumPy
- Pandas

# The Weather Dataset: Reading DataFrames from Files
***
The Weather Dataset is a time-series data set with per-hour information about the weather conditions at a particular location. It records Temperature, Dew Point Temperature, Relative Humidity, Wind Speed, Visibility, Pressure, and Conditions.

<img src="../images/weather.jpg" alt="Weather" style="width: 200px;"/>

This data is available as a CSV file. We are going to use Pandas DataFrames and analyse this dataset.

In [ ]:
# Read the data into a data frame
import pandas as pd
url="https://raw.githubusercontent.com/rkkirpane/APT-DATA/master/-Statistics-Part-I-master/weather_2012.csv"
weather_df = pd.read_csv(url) 
 
print("Shape:", weather_df.shape)
print("Index:", weather_df.index)
print(weather_df.head(5))

Shape: (8784, 8)
Index: RangeIndex(start=0, stop=8784, step=1)
             Date/Time  Temp (C)  ...  Stn Press (kPa)               Weather
0  2012-01-01 00:00:00      -1.8  ...           101.24                   Fog
1  2012-01-01 01:00:00      -1.8  ...           101.24                   Fog
2  2012-01-01 02:00:00      -1.8  ...           101.26  Freezing Drizzle,Fog
3  2012-01-01 03:00:00      -1.5  ...           101.27  Freezing Drizzle,Fog
4  2012-01-01 04:00:00      -1.5  ...           101.23                   Fog

[5 rows x 8 columns]

<img src="../images/icon/ppt-icons.png" alt="mini project
" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

## Mini - Challenge - 1
***
### Instructions
* Find all the unique Wind Speed values recorded in the dataset

In [ ]:
# Code your solution here
weather_df["Wind Spd (km/h)"].unique()

array([ 4,  7,  6,  9, 15, 13, 20, 22, 19, 24, 30, 35, 39, 32, 33, 26, 44,
       43, 48, 37, 28, 17, 11,  0, 83, 70, 57, 46, 41, 52, 50, 63, 54,  2])

<img src="../images/icon/ppt-icons.png" alt="mini project
" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

## Mini-Challenge - 2
***
### Instructions
* Find the number of times when the weather was exactly 'Clear'

<img src="../images/icon/Technical-Stuff.png" alt="Technical-Stuff" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

### How can we get the count for Clear ?
***

In order to get only the number of times when the weather was exactly 'Clear' , we need to used Square brackets after `.value_counts` 
eg. `.value_counts()[3]`

In [ ]:
# code your solution
weather_df["Weather"].value_counts()['Clear']

1326

<img src="../images/icon/ppt-icons.png" alt="mini project
" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

## Mini-Challenge - 3
***
**Try one more time..!!**
### Instructions
* Find the number of times when the wind speed was exactly 4 km/h

In [ ]:
# Your solution here
weather_df["Wind Spd (km/h)"].value_counts()[4]

474

<img src="../images/icon/ppt-icons.png" alt="mini project
" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

## Mini-Challenge - 4
***
### Instructions
* Get the first 3 alternating rows from the `weather_df` dataframe, but only the Visibility and Relative Humidity columns

In [ ]:
# Using loc or iloc
# NOTE: slice is `:5:2`, not 6 !
# first indexing
df1 = weather_df[:5:2]

# second indexing
df2 = df1[['Rel Hum (%)', 'Visibility (km)']]
df2

   Rel Hum (%)  Visibility (km)
0           86              8.0
2           89              4.0
4           88              4.8

<img src="../images/icon/Concept-Alert.png" alt="Concept-Alert" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

## Filtering
***

![Filter](../images/filters1.jpg)
Image Source:https://pixabay.com/en/yashica-filter-camera-vintage-711794/
<br/>

Anything that takes in data, processes it, and provides an output

Input Data ⟶ Filter ⟶ Output Data

Filtering rows of a DataFrame is an almost mandatory task for Data Analysis with Python. Given a Data Frame, we may not be interested in the entire dataset but only in specific rows.

### Instructions
* Access `Weather` column of dataframe and apply `.lower()` function and then apply `.contains()` by passing parameter as `rain` and save it as `snowed_filter`
* This will provide you boolean values to get the data pass the `snowed_filter` into dataframe `weather_df`
***
Whether or not it rain can be found out using the Weather column.

Note that this routine does not filter a dataframe on its contents. The filter is applied to the labels of the index.

In [ ]:
weather_df['Weather'].unique()

array(['Fog', 'Freezing Drizzle,Fog', 'Mostly Cloudy', 'Cloudy', 'Rain',
       'Rain Showers', 'Mainly Clear', 'Snow Showers', 'Snow', 'Clear',
       'Freezing Rain,Fog', 'Freezing Rain', 'Freezing Drizzle',
       'Rain,Snow', 'Moderate Snow', 'Freezing Drizzle,Snow',
       'Freezing Rain,Snow Grains', 'Snow,Blowing Snow', 'Freezing Fog',
       'Haze', 'Rain,Fog', 'Drizzle,Fog', 'Drizzle',
       'Freezing Drizzle,Haze', 'Freezing Rain,Haze', 'Snow,Haze',
       'Snow,Fog', 'Snow,Ice Pellets', 'Rain,Haze', 'Thunderstorms,Rain',
       'Thunderstorms,Rain Showers', 'Thunderstorms,Heavy Rain Showers',
       'Thunderstorms,Rain Showers,Fog', 'Thunderstorms',
       'Thunderstorms,Rain,Fog',
       'Thunderstorms,Moderate Rain Showers,Fog', 'Rain Showers,Fog',
       'Rain Showers,Snow Showers', 'Snow Pellets', 'Rain,Snow,Fog',
       'Moderate Rain,Fog', 'Freezing Rain,Ice Pellets,Fog',
       'Drizzle,Ice Pellets,Fog', 'Drizzle,Snow', 'Rain,Ice Pellets',
       'Drizzle,Snow,Fog', 'Rain,Snow Grains', 'Rain,Snow,Ice Pellets',
       'Snow Showers,Fog', 'Moderate Snow,Blowing Snow'], dtype=object)

In [ ]:
# Basically, we want a way to "filter out" records that  have the word "snow" (case insensitive) in the last column

snowed_filter = weather_df['Weather'].str.lower().str.contains('rain')
weather_df[snowed_filter].head()

               Date/Time  Temp (C)  ...  Stn Press (kPa)            Weather
18   2012-01-01 18:00:00       3.8  ...            99.74               Rain
19   2012-01-01 19:00:00       3.1  ...            99.68               Rain
22   2012-01-01 22:00:00       4.4  ...            99.32       Rain Showers
24   2012-01-02 00:00:00       5.2  ...            99.26       Rain Showers
153  2012-01-07 09:00:00      -6.1  ...           100.15  Freezing Rain,Fog

[5 rows x 8 columns]

###  Instructions
* Find all instances when wind speed was above 35 and visibility was 25 and sve it as `df` and print it.

In [ ]:
df = weather_df[(weather_df['Wind Spd (km/h)'] > 35) & (weather_df['Visibility (km)']== 25)]
df.head()

               Date/Time  Temp (C)  ...  Stn Press (kPa)        Weather
25   2012-01-02 01:00:00       4.6  ...            99.26         Cloudy
409  2012-01-18 01:00:00       3.7  ...            98.36  Mostly Cloudy
410  2012-01-18 02:00:00       0.5  ...            98.62  Mostly Cloudy
411  2012-01-18 03:00:00      -3.5  ...            99.00  Mostly Cloudy
412  2012-01-18 04:00:00      -6.1  ...            99.36           Snow

[5 rows x 8 columns]

<img src="../images/icon/Technical-Stuff.png" alt="Concept-Alert" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

# Pivot Tables : Excellent way to Summarize your Data!
***
- A pivot table is a tool that allows you to reorganize and summarize selected columns and rows of data in a dataframe <br/><br/>

- Pivot tables provide an easy way to subset by one column and then apply a calculation like a sum or a mean <br/><br/>

- Pivot tables first groups and only then applies a calculation

### Instructions
* A dictionary containing data is already defined in the variable `data`.
* Create a dataframe using dictionary `data` and save it as `df`
* Print the `df`

In [ ]:
data = {
    'A': ['foo','foo','foo','bar','bar','bar'],
    'B': ['one','one','two','two','one','one'],
    'C': ['x','y','x','y','x','y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### Instructions
* Use .pivot_table() on the dataframe with index as `A`, values as `D` , columns as `B` and  aggfunc as `np.sum`. Save it as `pivot_df` and print it out

In [ ]:
import numpy as np
pivot_df = df.pivot_table(
                values='D',      # We want to aggregate the values of which column?
                index='A',       # We want to use which column as the new index?
                columns='B',   # We want to use the values of which column as the new columns? (optional)
                aggfunc=np.sum)  # What aggregation function to use ?


pivot_df

B    one  two
A
bar    5    5
foo    4    2

### Instructions
* What is the mean Dew Point temperature recorded by month?
* Use .pivot_table() on the dataframe `weather_df` with index as `weather_df.index`, values as `Dew Point Temp (C)` , and  aggfunc as `np.mean`. Save it as `mean_dew_temperature_df` and print it out

In [ ]:
weather_df['Date/Time'] = pd.to_datetime(weather_df['Date/Time'])
mean_dew_temperature_df = weather_df.pivot_table(values='Dew Point Temp (C)', index=weather_df['Date/Time'].dt.month, aggfunc=np.mean)
mean_dew_temperature_df

           Dew Point Temp (C)
Date/Time
1                  -12.294758
2                   -9.221695
3                   -3.488575
4                   -1.934583
5                    8.080780
6                   11.738056
7                   14.595430
8                   15.644758
9                   10.757917
10                   6.533468
11                  -4.179306
12                  -6.129032

<img src="../images/icon/Technical-Stuff.png" alt="Concept-Alert" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

# Group By
***
The groupby method allows you to group rows of data together and call aggregate functions that applies to the whole group.

Any groupby operation involves one of the following operations on the original object. They are −
- Splitting the Object
- Applying a function
- Combining the results

In many situations, we split the data into sets and we apply some functionality on each subset. In the apply functionality, we can perform the following operations −

- Aggregation − computing a summary statistic
- Transformation − perform some group-specific operation
- Filtration − discarding the data with some condition

### Instructions
* Use `.groupby()` on `Weather` column  and aggregate the mean values of each column for different types of weather using `.mean()`

In [ ]:
mean_temperature_df2 = weather_df.groupby("Weather").agg(np.mean)
mean_temperature_df2

                                          Temp (C)  ...  Stn Press (kPa)
Weather                                             ...
Clear                                     6.825716  ...       101.587443
Cloudy                                    7.970544  ...       100.911441
Drizzle                                   7.353659  ...       100.435366
Drizzle,Fog                               8.067500  ...       100.786625
Drizzle,Ice Pellets,Fog                   0.400000  ...       100.790000
Drizzle,Snow                              1.050000  ...       100.890000
Drizzle,Snow,Fog                          0.693333  ...        99.281333
Fog                                       4.303333  ...       101.184067
Freezing Drizzle                         -5.657143  ...       100.202857
Freezing Drizzle,Fog                     -2.533333  ...       100.441667
Freezing Drizzle,Haze                    -5.433333  ...       100.316667
Freezing Drizzle,Snow                    -5.109091  ...       100.520909
Freezing Fog                             -7.575000  ...       102.320000
Freezing Rain                            -3.885714  ...        99.647143
Freezing Rain,Fog                        -2.225000  ...        99.945000
Freezing Rain,Haze                       -4.900000  ...       100.375000
Freezing Rain,Ice Pellets,Fog            -2.600000  ...       100.950000
Freezing Rain,Snow Grains                -5.000000  ...        98.560000
Haze                                     -0.200000  ...       101.482500
Mainly Clear                             12.558927  ...       101.248832
Moderate Rain,Fog                         1.700000  ...        99.980000
Moderate Snow                            -5.525000  ...       100.275000
Moderate Snow,Blowing Snow               -5.450000  ...       100.570000
Mostly Cloudy                            10.574287  ...       101.025288
Rain                                      9.786275  ...       100.233333
Rain Showers                             13.722340  ...       100.404043
Rain Showers,Fog                         12.800000  ...        99.830000
Rain Showers,Snow Showers                 2.150000  ...       101.100000
Rain,Fog                                  8.273276  ...       100.500862
Rain,Haze                                 4.633333  ...       100.540000
Rain,Ice Pellets                          0.600000  ...       100.120000
Rain,Snow                                 1.055556  ...        99.951111
Rain,Snow Grains                          1.900000  ...       100.600000
Rain,Snow,Fog                             0.800000  ...       100.730000
Rain,Snow,Ice Pellets                     1.100000  ...       100.105000
Snow                                     -4.524103  ...       100.536103
Snow Pellets                              0.700000  ...        99.700000
Snow Showers                             -3.506667  ...       100.963500
Snow Showers,Fog                        -10.675000  ...       101.292500
Snow,Blowing Snow                        -5.410526  ...        99.704737
Snow,Fog                                 -5.075676  ...       100.688649
Snow,Haze                                -4.020000  ...       100.782000
Snow,Ice Pellets                         -1.883333  ...       100.548333
Thunderstorms                            24.150000  ...       100.230000
Thunderstorms,Heavy Rain Showers         10.900000  ...       100.260000
Thunderstorms,Moderate Rain Showers,Fog  19.600000  ...       100.010000
Thunderstorms,Rain                       20.433333  ...       100.420000
Thunderstorms,Rain Showers               20.037500  ...       100.233750
Thunderstorms,Rain Showers,Fog           21.600000  ...       100.063333
Thunderstorms,Rain,Fog                   20.600000  ...       100.080000

[50 rows x 6 columns]

<img src="../images/icon/Technical-Stuff.png" alt="Concept-Alert" style="width: 100px;float:left; margin-right:15px"/>
<br /> 

# Concat, Merge and Join 
<br/>

***
There are 3 key ways of combining DataFrames together:

- **Concatenation**: Concatenation glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on <br/><br/>
- **Merging**: “Merging” two datasets aligns the rows from each based on common attributes or columns<br/><br/>
- **Join**: Join is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame

## Concat

Many a time, we are required to combine different arrays. So, instead of typing each of their elements manually, you can use array concatenation to handle such tasks easily.

In [ ]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
}, index=[0, 1, 2, 3])

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
}, index=[4, 5, 6, 7])

df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'E': ['D8', 'D9', 'D10', 'D11']
}, index=[8, 9, 10, 11])

### Instructions
* Three dataframes already defined for you
* Concat 3 dataframes i.e `df1`,`df2`,`df3` along rows

In [ ]:
# if you don't specify an axis, it defaults to axis=0, which means it appends to rows
pd.concat([df1, df2, df3])

      A    B    C    D    E
0    A0   B0   C0   D0  NaN
1    A1   B1   C1   D1  NaN
2    A2   B2   C2   D2  NaN
3    A3   B3   C3   D3  NaN
4    A4   B4   C4   D4  NaN
5    A5   B5   C5   D5  NaN
6    A6   B6   C6   D6  NaN
7    A7   B7   C7   D7  NaN
8    A8   B8   C8  NaN   D8
9    A9   B9   C9  NaN   D9
10  A10  B10  C10  NaN  D10
11  A11  B11  C11  NaN  D11

### Instructions
* Concat 3 dataframes i.e `df1`,`df2`,`df3` along columns

In [ ]:
# axis=1 means concat along columns

pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    E
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Join
***
Simply join two DFs having potentially different row indices

You can do both inner as well as outer joins using the join function in pandas
- Parameters {‘inner’, ‘outer’}, default ‘outer’. Outer for union and inner for intersection.

### Instructions
* Two dataframes i.e `left_df` and `right_df` already defined for you.
* Join two dataframes using `.join()` 
* Since it is an outer join pass `how='outer'`

In [ ]:
# Join
left_df = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=['K0', 'K1', 'K2']) 

right_df = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
}, index=['K0', 'K2', 'K3'])

left_df.join(right_df, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Merge

Many a times you will be working with multiple dataframes all at once.

The merge function allows them to be combined into a single data frame

### Instructions
* Two dataframes i.e `left` and `right` is already defined for you.
* From the left dataframe i.e. `left` and from the right dataframe i.e `right` you will be taking two columns for merging `key1` and `key2`; so pass them as on=['key1','key2'] inside the .merge() method
* Since it is an outer join pass `how='outer'` also

In [ ]:
# Merging on multiple keys
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
    
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [ ]:
# other options are 'inner', 'left', 'right'

pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Solution for in class activity

In [ ]:
# import the pandas library
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
print(grouped.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

# Bank Market Analysis



There has been a revenue decline for the Portuguese bank and they would like to know what actions to take. After investigation, we found out that the root cause is that their clients are not depositing as frequently as before. Knowing that term deposits allow banks to hold onto a deposit for a specific amount of time, so banks can invest in higher gain financial products to make a profit. In addition, banks also hold better chance to persuade term deposit clients into buying other products such as funds or insurance to further increase their revenues. As a result, the Portuguese bank would like to identify existing clients that have higher chance to subscribe for a term deposit and focus marketing effort on such clients. In this code along we are doing the data analysis using the pandas.


## Understanding the dataset

**Data Set Information**

The data is related to direct marketing campaigns of a Portuguese banking institution. The marketing campaigns were based on phone calls. Often, more than one contact to the same client was required, in order to access if the product (bank term deposit) would be ('yes') or not ('no') subscribed.
There are four datasets:
bank-additional-full.csv with all examples (41188) and 20 inputs, ordered by date (from May 2008 to November 2010), very close to the data analyzed in [Moro et al., 2014]
bank-additional.csv with 10% of the examples (4119), randomly selected from 1), and 20 inputs.
bank-full.csv with all examples and 17 inputs, ordered by date (older version of this dataset with fewer inputs).
bank.csv with 10% of the examples and 17 inputs, randomly selected from 3 (older version of this dataset with fewer inputs). The smallest datasets are provided to test more computationally demanding machine learning algorithms 
Goal:- The classification goal is to predict if the client will subscribe (yes/no) a term deposit (variable y).

**Features**

|Feature|Feature_Type|Description|
|-----|-----|-----|
|age|numeric|age of a person|  
|job |Categorigol,nominal|type of job ('admin.','blue-collar','entrepreneur','housemaid','management','retired','self-employed','services','student','technician','unemployed','unknown')|  
|marital|categorical,nominal|marital status ('divorced','married','single','unknown'; note: 'divorced' means divorced or widowed)|  
|education|categorical,nominal| ('basic.4y','basic.6y','basic.9y','high.school','illiterate','professional.course','university.degree','unknown') | 
|default|categorical,nominal| has credit in default? ('no','yes','unknown')|  
|housing|categorical,nominal| has housing loan? ('no','yes','unknown')|  
|loan|categorical,nominal| has personal loan? ('no','yes','unknown')|  
|contact|categorical,nominal| contact communication type ('cellular','telephone')|  
|month|categorical,ordinal| last contact month of year ('jan', 'feb', 'mar', ..., 'nov', 'dec')| 
|day_of_week|categorical,ordinal| last contact day of the week ('mon','tue','wed','thu','fri')|  
|duration|numeric| last contact duration, in seconds . Important note: this attribute highly affects the output target (e.g., if duration=0 then y='no')|
|campaign|numeric|number of contacts performed during this campaign and for this client (includes last contact)|  
|pdays|numeric| number of days that passed by after the client was last contacted from a previous campaign (999 means client was not previously contacted)|  
|previous|numeric| number of contacts performed before this campaign and for this client|  
|poutcome|categorical,nominal| outcome of the previous marketing campaign ('failure','nonexistent','success')|  
|emp.var.rate|numeric|employment variation rate - quarterly indicator|  
|cons.price.idx|numeric| consumer price index - monthly indicator|  
|cons.conf.idx|numeric| consumer confidence index - monthly indicator|  
|euribor3m|numeric|euribor 3 month rate - daily indicator|
|nr.employed|numeric| number of employees - quarterly indicator|   
|y | binary| has the client subscribed a term deposit? ('yes','no')|

### Read the data

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
url="https://raw.githubusercontent.com/rkkirpane/APT-DATA/master/-Statistics-Part-I-master/bank.csv"
df = pd.read_csv(url,delimiter=';')

In [ ]:
df.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [ ]:
df.describe()

               age       balance  ...        pdays     previous
count  4521.000000   4521.000000  ...  4521.000000  4521.000000
mean     41.170095   1422.657819  ...    39.766645     0.542579
std      10.576211   3009.638142  ...   100.121124     1.693562
min      19.000000  -3313.000000  ...    -1.000000     0.000000
25%      33.000000     69.000000  ...    -1.000000     0.000000
50%      39.000000    444.000000  ...    -1.000000     0.000000
75%      49.000000   1480.000000  ...    -1.000000     0.000000
max      87.000000  71188.000000  ...   871.000000    25.000000

[8 rows x 7 columns]

### Replace the `unknown` values with the `Nan` and check the value count of missing values and drop the missing rows

In [ ]:
# replace the unknown words with nan
df = df.replace('unknown', np.nan)

# check the null values
print(df.isnull().sum())

# dropna
df.dropna(inplace=True)

# check the null values
print(df.isnull().sum())

age             0
job            38
marital         0
education     187
default         0
balance         0
housing         0
loan            0
contact      1324
day             0
month           0
duration        0
campaign        0
pdays           0
previous        0
poutcome     3705
y               0
dtype: int64
age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

### Replace the column name from `loan` to `previous_loan_status` and `y` to `loan_status`

In [ ]:
df.rename(columns={'loan': 'previous_loan_status', 'y': 'loan_status'}, inplace=True)
print(df.head())

   age            job  marital  education  ... pdays  previous poutcome loan_status
1   33       services  married  secondary  ...   339         4  failure          no
2   35     management   single   tertiary  ...   330         1  failure          no
5   35     management   single   tertiary  ...   176         3  failure          no
6   36  self-employed  married   tertiary  ...   330         2    other          no
9   43       services  married    primary  ...   147         2  failure          no

[5 rows x 17 columns]

## Find out the information of the `job` column.

In [ ]:
# How many different variants of job are there?
print(df['job'].nunique())

#Total different types of job
print(df['job'].unique())

# Counts for different types of `job`
print(df['job'].value_counts())

11
['services' 'management' 'self-employed' 'blue-collar' 'admin.'
 'technician' 'unemployed' 'student' 'retired' 'housemaid' 'entrepreneur']
management       177
blue-collar      143
technician       137
admin.           102
services          58
retired           44
self-employed     26
entrepreneur      21
unemployed        20
student           19
housemaid         17
Name: job, dtype: int64

## Check the `loan_status`  approval rate by `job`

In [ ]:
df.groupby('job').loan_status.value_counts(normalize = True)

job            loan_status
admin.         no             0.754902
               yes            0.245098
blue-collar    no             0.881119
               yes            0.118881
entrepreneur   no             0.857143
               yes            0.142857
housemaid      no             0.705882
               yes            0.294118
management     no             0.734463
               yes            0.265537
retired        no             0.681818
               yes            0.318182
self-employed  no             0.846154
               yes            0.153846
services       no             0.758621
               yes            0.241379
student        no             0.578947
               yes            0.421053
technician     no             0.788321
               yes            0.211679
unemployed     no             0.750000
               yes            0.250000
Name: loan_status, dtype: float64

## Check the percentage of loan approved by `education`

In [ ]:
df[df['loan_status'] == 'yes']['education'].value_counts(normalize=True)

secondary    0.502924
tertiary     0.409357
primary      0.087719
Name: education, dtype: float64

## Check the percentage of loan approved by `previous loan status`

In [ ]:
df[df['loan_status'] == 'yes']['previous_loan_status'].value_counts(normalize=True)

no     0.929825
yes    0.070175
Name: previous_loan_status, dtype: float64

## Create a pivot table between `loan_status` and `marital ` with values form `age`

In [ ]:
pivot = df.pivot_table(index='loan_status', values='age', columns='marital')
print(pivot)

marital       divorced    married     single
loan_status
no           45.423729  43.416667  33.982759
yes          47.809524  46.447917  34.259259

## Loan status based on marital status whose status is married

In [ ]:
loan_stat=df[df['marital'].apply(lambda marital: marital == 'married')]
marital_status_summery= loan_stat['loan_status'].value_counts()
print (marital_status_summery)

no     360
yes     96
Name: loan_status, dtype: int64

## Create a  Dataframes

In [ ]:
# class 1
branch_1 = {
        'customer_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Andrew', 'Alex', 'Sabestian', 'Hilary', 'Jack'], 
        'last_name': ['Ng', 'Hales', 'Rachaska', 'Masan', 'Anthony']}
df_branch_1 = pd.DataFrame(branch_1, columns = ['customer_id', 'first_name', 'last_name'])
print(df_branch_1)

# class 2
branch_2 = {
        'customer_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Brain', 'Steve', 'Kim', 'Steve', 'Ben'], 
        'last_name': ['Alexander', 'Jobs', 'Jonas', 'Fleming', 'Richardsan']}
df_branch_2 = pd.DataFrame(branch_2, columns = ['customer_id', 'first_name', 'last_name'])
print(df_branch_2)

# test_score
credit_score = {
        'customer_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'score': [513, 675, 165, 961, 1080, 1654, 415, 900, 610, 1116]}
df_credit_score = pd.DataFrame(credit_score, columns = ['customer_id','score'])
print(df_credit_score)

  customer_id first_name last_name
0           1     Andrew        Ng
1           2       Alex     Hales
2           3  Sabestian  Rachaska
3           4     Hilary     Masan
4           5       Jack   Anthony
  customer_id first_name   last_name
0           4      Brain   Alexander
1           5      Steve        Jobs
2           6        Kim       Jonas
3           7      Steve     Fleming
4           8        Ben  Richardsan
  customer_id  score
0           1    513
1           2    675
2           3    165
3           4    961
4           5   1080
5           7   1654
6           8    415
7           9    900
8          10    610
9          11   1116

## Concatenate the dataframe `df_branch_1` and `df_branch_2` along the rows

In [ ]:
df_new = pd.concat([df_branch_1, df_branch_2])
print(df_new)

  customer_id first_name   last_name
0           1     Andrew          Ng
1           2       Alex       Hales
2           3  Sabestian    Rachaska
3           4     Hilary       Masan
4           5       Jack     Anthony
0           4      Brain   Alexander
1           5      Steve        Jobs
2           6        Kim       Jonas
3           7      Steve     Fleming
4           8        Ben  Richardsan

## Merge two dataframes `df_new` and `df_credit_score` with both the left and right dataframes using the `customer_id` key

In [ ]:
pd.merge(df_new, df_credit_score, left_on='customer_id', right_on='customer_id')

  customer_id first_name   last_name  score
0           1     Andrew          Ng    513
1           2       Alex       Hales    675
2           3  Sabestian    Rachaska    165
3           4     Hilary       Masan    961
4           4      Brain   Alexander    961
5           5       Jack     Anthony   1080
6           5      Steve        Jobs   1080
7           7      Steve     Fleming   1654
8           8        Ben  Richardsan    415

## Quiz
1. Which of the following statements are true regarding the Series and DataFrames?

```python
1. Series and DataFrames are the 2 key data structures in Pandas.
2. Series act like a 1-D labelled/indexed array.
3. Series doesn't allow accessing individual elements through labels.
4. A data frame is similar to Excel workbook
5. Series is a core data model whereas Data frame is a secondary model for Pandas.
Ans:- 1,2,4
```
2. Which are not a valid statements about the accelerated operations support in Pandas?

```python
1. Pandas library has support for accelerating certain types of binary numerical and boolean operations.
2. Pandas library's ability to support accelerated operations is useful for dealing with large data sets and speed improvements.
3. It is required to identify missing data in computations.
4. It helps in determining the broadcasting behavior between higher (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.
Ans:- 3,4
```
3. Which of the following Python libraries provides support for data munging?

```python
1.   NumPy
2.   Matplotlib
3.   Pandas
4.   SciPy
Ans:- 3
```

# Further Reading
***
- Pandas documentation: http://pandas.pydata.org/
- 10 minutes to pandas: https://pandas.pydata.org/pandas-docs/stable/10min.html
- Cookbook- Useful Pandas Recipes: https://pandas.pydata.org/pandas-docs/stable/cookbook.html
- Pandas and Python Top 10: http://manishamde.github.io/blog/2013/03/07/pandas-and-python-top-10/
- Intro to Pandas Data Structures: http://www.gregreda.com/2013/10/26/

# Thank You
***
### Coming up next...
***
- Visualizing data using `matplotlib`